fn main() {
    // 标量和复合类型

    // 类型标注
    let guess: u32 = "42".parse().expect("must be a number.");
    println!("the guess number is {}", guess);
    // 这里我们定义的 guess 是 u32 类型，通过 parse 方法将字符串转换为数字类型
    // parse 是不知道要转换成什么类型的数字的，所以需要我们显式地告诉它
    // 如果我们没有指定类型，编译器会报错

    // 标量类型
    // 一个标量类型代表一个单一的值
    // rust 有四种主要的标量类型：整数、浮点数、布尔值和字符

    // 整数类型
    // 有符号和无符号
    // i8、i16、i32、i64、i128、isize
    // u8、u16、u32、u64、u128、usize
    // 默认类型是 i32
    // isize 和 usize 类型依赖于计算机架构，在 64 位架构上是 64 位，在 32 位架构上是 32 位
    // 整数可以用十进制、十六进制（前缀 0x）、八进制（前缀 0o）和二进制（前缀 0b）表示

    // 浮点数类型
    // f32 和 f64 分别表示单精度和双精度浮点数，默认类型是 f64
    let x = 2.0; // f64
    let y: f32 = 3.0; // f32

    println!("x = {}, y = {}", x, y);

    // 数值操作
    // 加减乘除和取余
    let sum = 5 + 10;
    let difference = 95.5 - 4.3;
    let product = 4 * 30;
    let quotient = 56.7 / 32.2;
    let remainder = 43 % 5;

    println!(
        "sum = {}, difference = {}, product = {}, quotient = {}, remainder = {}",
        sum, difference, product, quotient, remainder
    );

    // 布尔类型
    // 只有两个可能的值：true 和 false
    // 只占用一个字节的内存
    let t = true;
    let f: bool = false;
    println!("t = {}, f = {}", t, f);

    // 字符类型
    // char，表示单个 Unicode 字符，占用四个字节的内存。
    let c = 'z';
    let z: char = 'ℤ';
    let heart_eyed_cat = '😻';
    println!("c = {}, z = {}, heart_eyed_cat = {}", c, z, heart_eyed_cat);

    // 复合类型
    // 复合类型可以将多个值组合成一个类型
    // 在 Rust 中有两种主要的复合类型：元组（tuple）和数组（array）

    // 元组类型
    // 元组可以让多个类型的多个值放在一个类型中
    // 元组的长度是固定的，一旦声明，不能增加或减少元素
    let tup: (i32, f64, u8) = (500, 6.4, 1);
    // 解构元组
    let (x, y, z) = tup;
    println!("The value of x, y, z is {}, {}, {}", x, y, z);
    // 通过索引访问元组元素
    println!("The first value of tup is {}", tup.0);
    println!("The second value of tup is {}", tup.1);
    println!("The third value of tup is {}", tup.2);

    // 数组类型
    // 数组中的所有元素类型必须相同，且长度固定
    // 数组的类型： [类型; 长度]
    // 数组适合存储一组相同类型且数量固定的数据，比如月份、时期等
    let a: [i32; 5] = [1, 2, 3, 4, 5];
    // 访问数组元素通过索引，索引从 0 开始
    println!("{}, {}, {}, {}, {}", a[0], a[1], a[2], a[3], a[4]);

    // 数组的另一种初始化方式，所有元素都初始化为相同的值
    let b = [3; 5]; // 等价于 let b = [3, 3, 3, 3, 3];
    println!("{}, {}, {}, {}, {}", b[0], b[1], b[2], b[3], b[4]);
    //数组存放在栈上，如果访问数组时使用了无效索引，程序会 panic 并退出
}
